{
  "title": "Per/severe",
  "address": {
    "line1": "3487 Boul. Saint-Laurent",
    "line2": "Montréal, QC H2X 2T6",
    "line3": "Canada"
  },
  "instagram": {
    "label": "Instagram",
    "link": "https://www.instagram.com/per___severe/"
  },
  "email": {
    "label": "Email",
    "link": "mailto:perseveremtl@gmail.com"
  },
  "upcoming": {
    "label": "Upcoming",
    "date": "November 11, 2023",
    "title": "Per/severe: A Philanthropic Multimedia Exhibit"
  },
  "homepage": {
    "imageCaption": "Artwork collaboration with Kat Barr."
  },
  "blogPost": {
    "authorLabel": "Words by: "
  },
  "blog": "Blog",
  "persevere2022": {
    "title": "Per/severe 2022",
    "openingWords": "Thanks to the support of our community, last year's exhibit was an overwhelming success. Our exhibit welcomed 250 attendees who celebrated the work of nine artists, four designers, and three musical acts. Three of nine artists sold exhibited works, reaching our goal of platforming emerging talent. The event provided a platform for creatives and enabled us to raise $3,810 for Face à Face, with 100% of the proceeds going directly to their essential services.",
    "readMore": "Read about featured artists:"
  },
  "persevere2023": {
    "title": "Per/severe 2023",
    "readMore": "Read about featured artists:"
  },
  "about": {
    "title": "About",
    "paragraph1": "Per/severe is a Montréal-based student initiative founded by McGill students. Our initiative strives to create a platform for local artists while fostering engagement between students and the broader Montréal community. Our event is held in support of Face à Face, a local charity offering vital support services to individuals experiencing homelessness. These services encompass housing assistance, mail reception, and active listening sessions to help those without homes and other underserved communities.",
    "paragraph2": "For the second year in a row, Per/severe is curating a multimedia exhibit on November 11, 2023 at WIP Works Studios. The exhibit will showcase a diverse array of art, live performances and fashion presentations delivered by local creatives. Further, featured artists and designers, as well as local art and literary publications will sell their works at our exhibit's gift shop. Don't miss it!"
  }
}
