[
  {
    "id": "hunter-schafer-greeces-most-precious-secret",
    "title": "Hunter Schafer: Greece's Most Precious Secret",
    "date": "31.10.2023",
    "author": "Nicole Kastanias",
    "image": "/hunter-schafer-greeces-most-precious-secret.jpg",
    "body": [
      "When we think of Halloween, you may think of your favorite scary movie, or a mini Twix. The last thing you would connect with the comforting spookiness of the season is a vacation in Santorini, but here at PerSevere, Greece is putting spooky vibes in our air and fear in our hearts.",
      "In the spirit of Halloween, we would like to appreciate a country with one of the weirdest vibes on earth, and now its own unique genre of film, Greek Weird Wave. Cultivating a signature brand of “Weirdness” has been no small feat; the Greek economic crisis, recent violent protests, and raging wildfires have given rise to Greek Weird Wave.",
      "Greek director Yorgos Lanthimos, known for his films The Killing of A Sacred Deer, and Dogtooth, alongside director Athina Tsangari, has been at the forefront of the genre in its newfound recognition; \"I help her with her film, she helps me with mine. There are no real producers in Greece and no public money anymore. Most of the time we don't really know how to do it, it's a nightmare. But at least it's done out of love.\"",
      "The genre confronts the harsh realities of the 21st century through an unorthodox perspective, through its use of deadpan and bizarre dialogue, surrealism, and social commentary, “young greeks are up against the tyranny of ancestry, of Greece's nostalgia for its own history. The 21st century is something all of us are trying to subvert.",
      "His new star-studded film Poor Things with Margaret Qualley, Willem Dafoe, and Emma Stone is set to release this December, after a decade-long hiatus since his most recent major film.",
      "While you may have seen teasers for “the R-rated Frankenstein-esque tale that's tearing up the film festival circuit,” Lanthimos has an anthology film scheduled to release only months later, starring Hunter Schafer, that he's keeping secret from you.  In true Greek fashion, little is known about his new secret film, outside of its location being set in New Orleans. ",
      "More info TBD as we await news from the PerSevere branch in Greece. Until then, we urge you to take notes from the Greek Weird Wave tonight. Happy Halloween!"
    ]
  },
  {
    "id": "ilana-savdie-illuminates-the-unseen",
    "title": "Ilana Savdie Illuminates the Unseen",
    "date": "29.10.2023",
    "author": "Christina Lee",
    "image": "/ilana-savdie-illuminates-the-unseen.jpg",
    "body": [
      "In the heart of Manhattan's cultural landscape, the Whitney Museum has once again succeeded in bringing forth an artist whose work challenges conventions and pushes the boundaries of artistic expression. Ilana Savdie, with her groundbreaking exhibition “Radical Contradictions,” presents a mesmerizing journey into the intricacies of identity, perception, and the human experience. Savdie's innovative exploration of visual storytelling, rooted in deeply personal narratives, takes the viewer on a thought-provoking odyssey that transcends the traditional confines of artistic expression.",
      "Born in Venezuela to parents of Syrian and Moroccan descent, Savdie's multicultural upbringing informs much of her work. “Radical Contradictions” revolves around themes of identity, performance, transgression, and power. Savdie's inquiry into forms of resistance and protest through mockery, exaggeration, and the grotesque are influenced by her experience growing up around the Carnaval de Barranquilla. She is particularly drawn to the Marimonda, a figure from the Carnaval known in folklore to mock the so-called elite. ",
      "Savdie combines soft, blurred textures with areas of thick brushstrokes of acrylic, oil, and beeswax to create dreamlike illusions grounded with recognizable yet distorted figures. The Marimonda appears in her painting, ‘Tickling the Before and After' (Cosquilleo Interior),' slipping in and out of forms. This character is quick-witted yet disruptive; its provocative ethos is represented through expressive colours, forms, textures, and material techniques.",
      "Savdie's exploration of identity is not limited to her personal story; it extends to the collective human experience. “Radical Contradictions” invites viewers to reflect on their own identities and how they intersect with the broader social, political, and cultural context. It urges us to confront the contradictions that define our world. Savdie's exhibition reaffirms the power of art to illuminate the unseen and provoke insightful reflection on the world we inhabit."
    ]
  },
  {
    "id": "sandy-liang-the-girl-who-gets-it",
    "title": "Sandy Liang: the girl who gets it.",
    "date": "21.10.2023",
    "author": "Christina Lee",
    "image": "/sandy-liang-the-girl-who-gets-it.jpg",
    "body": [
      "Sandy Liang's work is nothing short of a love letter to girlhood. Through her aesthetic of unapologetic femininity, the native Lower East Side fashion designer has ignited a renaissance of bows and flooded our pinterest boards. In an interview with British Vogue, Liang discusses her creations revealing: ",
      "\"Childhood is a huge inspiration because it's very tender and sweet - my clothes end up being autobiographical, in many ways.\"",
      "“I'm just a girl designing for a girl,” she admits to Harpers Bazaar. One cannot help but see the traces of Romanticism and reinterpretations of Victorian style in Liang's pieces. Her use of tulle and satin evokes images of corseted ladies strolling through the gardens of an English manor. However, these elements are given a contemporary twist.",
      "Pleated skirts and dresses, inspired by schoolgirl uniforms, are reimagined. They embody the nostalgia for a simpler time when we reveled in the simplest of pleasures, but they also remind us that we can embrace the past without being trapped by it. These pieces are not just garments; they're vehicles that transport us back to moments of carefree bliss. In Liang's world, lace isn't just lace; it's a living memory of tea parties and whispered secrets. Ballet flats, reminiscent of innocent twirls and childhood recitals, have strided confidently back into the wardrobes of women who understand that femininity is not a limitation but a celebration.",
      "In a world that sometimes teaches women to leave behind their girlhood dreams and adorn themselves with a suit of stern professionalism, Sandy Liang's designs are an invitation to revisit our early years of self-expression. It's a statement that one can be both a grown-up and a girl, a woman and a dreamer, all in the same breath."
    ]
  },
  {
    "id": "lulu-kennedys-fashion-east",
    "title": "Lulu Kennedy's Fashion East",
    "date": "18.10.2023",
    "author": "Nicole Kastanias",
    "image": "/lulu-kennedys-fashion-east.jpg",
    "body": [
      "The Persevere midterm is coming up, and you're going to have to cram this weekend if you haven't already started studying. The midterm content will cover the infamous Lulu Kennedy and her legacy at Fashion East. Lucky for you, the best way to prepare for this is to participate in a local rave near you. ",
      "Lulu Kennedy “accidentally” founded Fashion East in the early 2000s when she returned to London from Naples where she lived during the 1990s hosting warehouse raves for a living. Since her lucrative career as a rave hostess, her showcase project Fashion East has celebrated 24 years of exhibiting and launching the careers of major names such as Nensi Dojaka, Mowalola, Jonathan Anderson, Martine Rose, and Supriya Lele, to name a few. ",
      "This year's Fashion East in London featured three new and wildly different Spring 2024 Ready-to-Wear collections from Olly Shinder, Standing Ground, Johanna Parv.",
      "This season Olly Shinder asked friends and queer community members to walk and collaborate within the show. Shinder transformed workwear into a queer fantasy and played with menswear classics. With zippers that extend below the botox and utility jackets, the mantra for his show asks, “Are we in touch?”",
      "“Menacing sensuality” was the name of the game for Standing Ground this season. Literally returning to the ground to accomplish this, continental drift and evolution were the basis for geologically inspired inseams and sensual fossil-like pleats.",
      "Tailoring activewear and combining 60s housewife silhouettes with jersey to produce versatile and comfortable garments, Johanna Parv “sees women as soldiers.” In a certain Helmut Lang fashion, Parv is truly forging a category of her own. ",
      "Add these notes to your quizlets, and please remember that Chat GPT won't be of any use if you don't have an artistic eye. ",
      "Best of Luck!"
    ]
  },
  {
    "id": "kiko-kostadinov-spring-2024-ready-to-wear-collection",
    "title": "Kiko Kostadinov: Spring 2024 Ready-To-Wear Collection",
    "date": "13.10.2023",
    "author": "Christina Lee",
    "image": "/kiko-kostadinov-spring-2024-ready-to-wear-collection.jpg",
    "body": [
      "In the tapestry of Kiko Kostadinov's Spring 2024 Ready-To-Wear collection, designers Laura and Deanna Fanning wove a tale of inspiration drawn from the legendary artist and textile designer, Sonia Delaunay. ",
      "The collection reflects Kostadinov's signature aesthetic, featuring innovative tailoring, intricate detailing, and a bold yet minimalist colour palette. With a keen eye for merging form and function, it offers a range of versatile pieces that effortlessly transition from day to night. It's a celebration of modern elegance and the designer's commitment to pushing the boundaries of fashion while maintaining a strong focus on comfort and wearability. ",
      "After graduating from Central Saint Martin in 2018, the London-based twin sister duo immediately took on their roles as co-creative directors at Kiko Kostadinov. In an interview with Hypebeast, they spoke about the collection saying: ",
      "\"We started the collection with a reference image of patchwork, and initially, it was a really old image of a Sonia Delaunay dress with a satin drape in black and velvet patchwork in multicolor. This led us to look through history and reflect on our heroines throughout fashion design.\"",
      "Sonia Delaunay, a luminary of the avant-garde art scene in the early 20th century, not only revolutionized the canvas but also left an indelible mark on the world of fashion. She was a pioneer in the realm of Orphism, exhibiting bold geometric shapes and a vivid palette. Delaunay's artistic vision seamlessly spilled over into fashion design, where her use of colour and pattern disrupted the prevailing norms. She brought a kinetic energy to textiles and garments, transforming them into living canvases. Through her trailblazing designs, Delaunay became a harbinger of modernity in fashion, igniting a lasting dialogue between art and style. ",
      "In looking back, Kiko Kostadinov looks forward. As they pay homage to the greats that came before them, the sheer brilliance of this collection proves themselves to be an inspiration for generations to come."
    ]
  },
  {
    "id": "persevere-presents-a-bedtime-story-carlijn-jacobs-at-foam",
    "title": "Persevere Presents a Bedtime Story: Carlijn Jacobs at Foam",
    "date": "10.10.2023",
    "author": "Nicole Kastanias",
    "image": "/persevere-presents-a-bedtime-story-carlijn-jacobs-at-foam.jpg",
    "body": [
      "Find a nice comfy spot on your pillow. Feel your arms and legs growing heavy, wiggling your fingers and toes. Picture a stream somewhere in the Netherlands, with Florence Pugh dancing by the water's edge in a crown of flowers, as it twists and winds its way into the heart of Amsterdam. Now wake up. ",
      "Dutch photographer Carlijn Jacobs, famous for photographing Beyonce's Renaissance, recently opened her “Sleeping Beauty” exhibition at Foam in Amsterdam.",
      "Dancing the line between fashion and art with a certain flower-crown-lighthearted approach, Jacobs' work exudes a certain silliness that resonates among our team at Persevere. Jacobs describes her colorful and expressive surrealist work as being about “the ability to play,” with a larger goal of peculiarity rather than perfection. ",
      "Despite the bright-eyed image of this young Dutch artist that may be coming to mind, Carlijn Jacobs has already done her rounds at Vogue, Dazed, Chanel, Mugler, and Louis Vuitton among other campaigns and magazines. Jacobs' ability to welcome change and capture the slippery spirit of fluidity has earned her recognition as an important eye in the visual culture of the modern digital age. Both timeless and alienating, Jacobs manages to forge an alternative stylistic approach while working with big names.",
      "Driven by the “rush of being able to see new things,” and the desire to get out of her small town - fast,  Jacobs draws from art styles of the 1980s and 90s along with traditional disguise and costume such as that of the Geisha, while warping, staging, and transforming her subjects. ",
      "Reality-shifting digital innovations such as AI fuel Jacobs' fascination with their imaginative potential to create new worlds and play into the unexpected. Her exhibition “Sleeping Beauty” draws its name from the prolific punishment of female curiosity in the story of Adam and Eve, but punishment for Jacob's insatiable curiosity is nowhere in sight. "
    ]
  },
  {
    "id": "critical-nerd-theory",
    "title": "Critical Nerd Theory",
    "date": "02.10.2023",
    "author": "Nicole Kastanias",
    "image": "/critical-nerd-theory.jpg",
    "body": [
      "I hope you've all done the readings for today's lecture on the applications of Critical Nerd Theory to the recent rise of Prep and Geek-Chic which simply cannot be ignored.",
      "In the words of Rachel Tashjian at Harpers Bazaar, “it's Scotchy-Wotchy time — but why?” In a time of ultra-light speed fashion trend cycles and economic recession, it's hard not to be seduced by the comfortingly familiar lures of quality, timelessness and luxury offered by the khaki pant and the polo shirt. ",
      "While some see the return of the nerd as an act of hypocrisy by those who criticize class privilege online while celebrating its visual allure, others believe that this view lacks one key piece of the geek puzzle. That puzzle piece is in the shape of Bella Hadid's ultra-thin 90s librarian glasses. In other words, the sexification of prep. As geek chic returns, pleated skirts that were once knee length are now barely covering bum cheeks, and dress shirts are being cropped and \"deconstructed.\" ",
      "Some see this departure from the traditions of non-sexy prep as a sign that the classist barriers to entry of prep are being stripped away with each glimpse of a butt cheek through a pleated skirt. Progressive youth are claiming once exclusive and discriminatory signals of wealth and privilege, regardless of class, while having fun and poking fun at it. ",
      "Before the bell rings I'd like to leave you with this question; who's really the brains behind fashion this school season? The muddy geeks or the preppy freaks?"
    ]
  },
  {
    "id": "preppy-freaks-and-unsanitized-geeks",
    "title": "Preppy Freaks & Unsanitized Geeks",
    "date": "30.09.2023",
    "author": "Nicole Kastanias",
    "image": "/preppy-freaks-and-unsanitized-geeks.jpg",
    "body": [
      "It's officially October; the leaves have begun to turn, and our feeds are full of old-money-dark-academia-quiet-luxury-elevated-basics wardrobe ideas. Aritzia sales are at an all time high. But wait… what's that we hear? Is that the sound of… mud splashing? Yes. Through the leaves crunching under our feet as we walk to class, we can hear the distant sound of the models in Elena Velez's spring 2024 ready-to-wear collection on their hands and knees mauling each other in a puddle of mud at New York Fashion Week.",
      "In an act of outright violence against the cream coloured cable knit sweaters littering our local campuses, Elena Velez's new collection challenges the “standard niceties of femininity.” Velez's notorious antiheroine ethos draws from her deep rejection of the sanitized and unilateral vision of womanhood in contemporary culture, and its tendency to reduce female depth, multiplicity and nuance. Velez takes the time to imagine what a female antiheroine would look like. Drawing inspiration from the American Midwest, many of her pieces reference the gritty women of bygone eras of Americana, or more accurately, what might be left of their tattered corsets in the crop-top-bustiers on racks in Zara stores today. ",
      "Cathay Horyn at The Cut suggests that the luxury goods industry plays a large role in flattening the female into “clean,” “nice,” and “good,” and erasing opportunities for her to get “fierce and nasty, and complex” on the runway. Considering this, along with Kylie Jenner's recent pivot from clean-bodycon to a mud-covered, baggy silhouette for her appearance as the new face of Acne Studios Denim, it may be tempting to wear your white cable knit sweater out for a nice roll through a pumpkin patch, or join in on some sexy mud-wrestling this weekend. But before you go, think of Hailey Baldwin. Sophia Richie. Think of quiet luxury Tiktok."
    ]
  }
]
