[
  {
    "id": "digging-through",
    "title": "Digging through November with Westdale",
    "subtitle": "Daniel Styles aka Westdale pulled out his reading glasses to examine in detail our busy program for November. There are three events the Vitamin resident and Infame Radio/Markham Road daddy doesn't want you to miss. Dig along.",
    "date": "Sun 29 Oct 2023",
    "author": "Defne Avci",
    "image": "/digging-through.jpg",
    "body": [
      "Guess it's bound to get chilly one of these days so why not turn up the thermostat at your local soap factory? Headed into my third year of Ankali visits, it's always like Christmas day when that new monthly program hits the Instagram feed. Once a month we all get out our reading glasses and scour through another lineup of excitement. This coming month is no outlier and guests will be able to get involved with an ever thriving local scene + some pretty cool international collaborations. I've tried to share some starting points for a few of these nights and their various components. If you make it out to any of these parties, I'd love to hear from you… and I'm sure the Ankali team would too <3",
      "The first Friday of the month falls under in-house protocol with another strong edition of No Borders being booked into action. While most have had some sort of experience with this party series, two encounters are never alike…",
      "My first contact with No Borders was about a year ago when Octa Octa and Jasmín came to town. The duality of sounds and energies spread across Ankali and Planeta Za was some sort of a revelation. Just like day to day life the party seemed to ebb and flow in the most natural sort of way. As the same suggests, No Borders lacks some sort of strict sonic definition and resolves for a wider melange of characteristics. This decision however doesn't come from a lack of attentive booking, but more so a reflection of the artists being booked. Take local legend Psj for example… Not only well versed in breaks/trance/electro, Psj's catalogue spans wide into the worlds of house, downtempo, and ambient (as shown by this beautiful mix for Nachtdigital)",
      "And when Psj sits beside NCOL, Yan, and Roza Terenzi, you know there's one heck of a night brewing. For a soundbite of what's to come check out NCOL and Yan b2b at our <3 home club Vitamin <3 back last year during the second annual Ankali x Vitamin exchange."
    ]
  },
  {
    "id": "sandy-liang",
    "title": "Sandy Liang: the girl who gets it.",
    "date": "Sat 21 Oct 2023",
    "author": "Christina Lee",
    "image": "/sandy-liang.jpg",
    "body": [
      "Sandy Liang's work is nothing short of a love letter to girlhood. Through her aesthetic of unapologetic femininity, the native Lower East Side fashion designer has ignited a renaissance of bows and flooded our pinterest boards. In an interview with British Vogue, Liang discusses her creations revealing:",
      "“Childhood is a huge inspiration because it's very tender and sweet - my clothes end up being autobiographical, in many ways.”",
      "“I'm just a girl designing for a girl,” she admits to Harpers Bazaar. One cannot help but see the traces of Romanticism and reinterpretations of Victorian style in Liang's pieces. Her use of tulle and satin evokes images of corseted ladies strolling through the gardens of an English manor. However, these elements are given a contemporary twist.",
      "Pleated skirts and dresses, inspired by schoolgirl uniforms, are reimagined. They embody the nostalgia for a simpler time when we reveled in the simplest of pleasures, but they also remind us that we can embrace the past without being trapped by it. These pieces are not just garments; they're vehicles that transport us back to moments of carefree bliss. In Liang's world, lace isn't just lace; it's a living memory of tea parties and whispered secrets. Ballet flats, reminiscent of innocent twirls and childhood recitals, have strided confidently back into the wardrobes of women who understand that femininity is not a limitation but a celebration.",
      "In a world that sometimes teaches women to leave behind their girlhood dreams and adorn themselves with a suit of stern professionalism, Sandy Liang's designs are an invitation to revisit our early years of self-expression. It's a statement that one can be both a grown-up and a girl, a woman and a dreamer, all in the same breath."
    ]
  },
  {
    "id": "sonia-delaunay",
    "title": "A woven tale of inspiration: Sonia Delaunay.",
    "date": "Fri 13 Oct 2023",
    "author": "Christina Lee",
    "image": "/sonia-delaunay.jpg",
    "body": [
      "In the tapestry of Kiko Kostadinov’s Spring 2024 Ready-To-Wear collection, designers Laura and Deanna Fanning wove a tale of inspiration drawn from the legendary artist and textile designer, Sonia Delaunay.",
      "The collection reflects Kostadinov’s signature aesthetic, featuring innovative tailoring, intricate detailing, and a bold yet minimalist colour palette. With a keen eye for merging form and function, it offers a range of versatile pieces that effortlessly transition from day to night. It’s a celebration of modern elegance and the designer’s commitment to pushing the boundaries of fashion while maintaining a strong focus on comfort and wearability.",
      "After graduating from Central Saint Martin in 2018, the London-based twin sister duo immediately took on their roles as co-creative directors at Kiko Kostadinov. In an interview with Hypebeast, they spoke about the collection saying:",
      "“We started the collection with a reference image of patchwork, and initially, it was a really old image of a Sonia Delaunay dress with a satin drape in black and had velvet patchwork in multicolor. This led us to look through history and reflect on our heroins throughout fashion design.”",
      "Sonia Delaunay, a luminary of the avant-garde art scene in the early 20th century, not only revolutionized the canvas but also left an indelible mark on the world of fashion. She was a pioneer in the realm of Orphism, exhibiting bold geometric shapes and a vivid palette. Delaunay’s artistic vision seamlessly spilled over into fashion design, where her use of colour and pattern disrupted the prevailing norms. She brought a kinetic energy to textiles and garments, transforming them into living canvases. Through her trailblazing designs, Delaunay became a harbinger of modernity in fashion, igniting a lasting dialogue between art and style.",
      "In looking back, Kiko Kostadinov looks forward. As they pay homage to the greats that came before them, the sheer brilliance of this collection proves themselves to be an inspiration for generations to come."
    ]
  },
  {
    "id": "bedtime-story",
    "title": "Bedtime Story: Carlijn Jacobs at Foam",
    "date": "Tue 10 Oct 2023",
    "author": "Nicole",
    "image": "/bedtime-story.jpg",
    "body": [
      "Find a nice comfy spot on your pillow. Feel your arms and legs growing heavy, wiggling your fingers and toes. Picture a stream somewhere in the Netherlands, with Florence Pugh dancing by the water's edge in a crown of flowers, as it twists and winds its way into the heart of Amsterdam. Now wake up.",
      "Dutch photographer Carlijn Jacobs, famous for photographing Beyonce’s Renaissance, recently opened her “Sleeping Beauty” exhibition at Foam in Amsterdam.",
      "Dancing the line between fashion and art with a certain flower-crown-lighthearted approach, Jacobs' work exudes a certain silliness that resonates among our team at Persevere. Jacobs describes her colorful and expressive surrealist work as being about “the ability to play,” with a larger goal of peculiarity rather than perfection.",
      "Despite the bright-eyed image of this young Dutch artist that may be coming to mind, Carlijn Jacobs has already done her rounds at Vogue, Dazed, Chanel, Mugler, and Louis Vuitton among other campaigns and magazines. Jacobs’ ability to welcome change and capture the slippery spirit of fluidity has earned her recognition as an important eye in the visual culture of the modern digital age. Both timeless and alienating, Jacobs manages to forge an alternative stylistic approach while working with big names.",
      "Driven by the “rush of being able to see new things,” and the desire to get out of her small town - fast,  Jacobs draws from art styles of the 1980s and 90s along with traditional disguise and costume such as that of the Geisha, while warping, staging, and transforming her subjects.",
      "Reality-shifting digital innovations such as AI fuel Jacobs’ fascination with their imaginative potential to create new worlds and play into the unexpected. Her exhibition “Sleeping Beauty” draws its name from the prolific punishment of female curiosity in the story of Adam and Eve, but punishment for Jacob’s insatiable curiosity is nowhere in sight."
    ]
  }
]
