[
  {
    "name": "JOE CARLO ROMERO",
    "description": "A multidisciplinary artist based in Montreal with a primary background in painting, video art, and installation—inspired by cinegraphic mediums that explore the still qualities of prosaic moments. Joe’s paintings deal with contrasting hues and tones to create a division between the mundane and the surreal: illustrating ethereal environments and dreamscapes within the themes of escapism and surrealism."
  },
  {
    "name": "JOCELYN WONG",
    "description": "'Jocelyn Wong 黃悦 (b. 2002) is a Montreal-based photographer born and raised in Hong Kong. Rejecting her heritage in her youth, she now recognizes the value of one's culture and attempts to reclaim hers through street photography. With her hometown as the primary setting, her images document the city during and post-pandemic, illustrating its changes since the 2019 extradition bill. She takes significant inspiration from \"Bresson of Hong Kong\" Yau Leung, who references the pioneer of street photography, Henri Cartier-Bresson. Her medium of choice is film photography, as she is fascinated by the vintage feel, the element of surprise, and the need to be intentional with each shot. Through her use of candids, she depicts people in their natural state, hoping to document how the underlying progression of the political turmoil has woven into the bustling urban fabric that stitches her identity.'"
  },
  {
    "name": "FAEZAH MUGHAL",
    "description": "Faezah Mughal (b. 2000, Toronto, Ontario) is a Montréal-based artist who mostly paints ghostly, unearthly figures in hazy landscapes that explore topics of womanhood, trauma, nostalgia and spiritualism. She is interested in theology, and religious symbolism often appears in her work, inspired by Biblical and Quranic stories and her Sufi upbringing. Her mediums of preference are ink and oil on canvas."
  },
  {
    "name": "JULIE ROCH-CUERRIER",
    "description": "Julie Roch-Cuerrier is a visual artist living and working in Montréal, Canada. Her practice focuses on the passage of time as a living subject and on the temporal and transformational processes of matter. Through an array of mediums including sculpture, photography and installation, she questions the agency of objects, the liminality of matter, and the spectrality of spaces where the living and non-living intersect."
  },
  {
    "name": "AOIFE BALDWIN-MAHER",
    "description": "Aoife Baldwin-Maher is a multidisciplinary visual artist who works with ink, watercolour, digital drawing, printmaking, murals, video, animation and performance. A guest on turtle island, they are a second-generation member of the Irish diaspora and live in Tiohtia:ke (Montréal.) Aoife studied in the drawing program at the Alberta College of Art and Design and then later at Concordia University in the Intermedia program working with video and performance. Regardless of their numerous mediums, Aoife’s art invariably espouses queer and feminist themes. At the center of their work the body is represented either realistically or as an abstract entity, most often somewhere in the space in between. They currently host and coordinate a weekly life drawing session called Antimodele which can be found on social media as @drawnbyaoife."
  },
  {
    "name": "AUDREY CHA",
    "description": "Audrey is an abstract artist based in Montréal, Canada. Growing up, she always had a great interest in art and aesthetics. As a child, she played the piano and fell in love with travel photography in her early twenties. Her eyes are constantly trying to capture beauty, emotion, harmony and interesting compositions in what she is observing. She also has a strong passion for people and how they relate to themselves and to others. She completed a doctorate degree in psychology and has been practicing psychodynamic psychotherapy since 2008. Throughout those years, she remained drawn to art in many ways in her life. In 2020, she discovered watercolours and their magic and the unpredictable way water mixes with different pigments of colour. From this moment, there was no turning back, art had to play a greater role in her life."
  },
  {
    "name": "EMILIE CHAMBERLAND",
    "description": "(née en 1992) est une artiste multidisciplinaire québécoise vivant à Montréal. Avec un parcours en musique et en art visuel, son travail actuel l’amène à développer une sensibilité artistique qu’elle caractérise d’intuitive. Par l’entremise de médiums mixtes, Émilie propose une réflexion sur l’exploration de l’inconscient grâce à des œuvres profondément instinctives. En écho au principe du défoulement, elle va même jusqu'à fermer les yeux durant la création, se laissant ainsi guider par le moment présent. De ses oeuvres se dégagent certaines contradictions; entre complexité et simplicité, ou bien entre douceur et souffrance. Les créations d’Émilie illustrent l’harmonie qui est rendue possible par ces contradictions. Sa proposition artistique s’interroge sur l’art comme outil de croissance et ainsi elle alimente l’expérimentation dans l’idée de découvrir de nouvelles façons d'expression à travers ses différentes techniques."
  }
]
